module {
  func.func @main(%arg0: tensor<?x?x64xf32>) -> tensor<?x?x64xf32> {
    %cst = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_17> : tensor<64xf32>
    %cst_0 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_16> : tensor<64xf32>
    %cst_1 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_15> : tensor<64xf32>
    %cst_2 = stablehlo.constant dense_resource<torch_tensor_64_256_torch.float32_1> : tensor<64x256xf32>
    %cst_3 = stablehlo.constant dense_resource<torch_tensor_256_torch.float32_1> : tensor<256xf32>
    %cst_4 = stablehlo.constant dense_resource<torch_tensor_256_64_torch.float32_1> : tensor<256x64xf32>
    %cst_5 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_14> : tensor<64xf32>
    %cst_6 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_13> : tensor<64xf32>
    %cst_7 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_12> : tensor<64xf32>
    %cst_8 = stablehlo.constant dense_resource<torch_tensor_64_64_torch.float32_7> : tensor<64x64xf32>
    %cst_9 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_11> : tensor<64xf32>
    %cst_10 = stablehlo.constant dense_resource<torch_tensor_64_64_torch.float32_6> : tensor<64x64xf32>
    %cst_11 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_10> : tensor<64xf32>
    %cst_12 = stablehlo.constant dense_resource<torch_tensor_64_64_torch.float32_5> : tensor<64x64xf32>
    %cst_13 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_9> : tensor<64xf32>
    %cst_14 = stablehlo.constant dense_resource<torch_tensor_64_64_torch.float32_4> : tensor<64x64xf32>
    %cst_15 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_8> : tensor<64xf32>
    %cst_16 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_7> : tensor<64xf32>
    %cst_17 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_6> : tensor<64xf32>
    %cst_18 = stablehlo.constant dense_resource<torch_tensor_64_256_torch.float32> : tensor<64x256xf32>
    %c256_i64 = arith.constant 256 : i64
    %cst_19 = stablehlo.constant dense_resource<torch_tensor_256_torch.float32> : tensor<256xf32>
    %cst_20 = stablehlo.constant dense_resource<torch_tensor_256_64_torch.float32> : tensor<256x64xf32>
    %cst_21 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_5> : tensor<64xf32>
    %cst_22 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_4> : tensor<64xf32>
    %cst_23 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_3> : tensor<64xf32>
    %cst_24 = stablehlo.constant dense_resource<torch_tensor_64_64_torch.float32_3> : tensor<64x64xf32>
    %cst_25 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_2> : tensor<64xf32>
    %cst_26 = stablehlo.constant dense_resource<torch_tensor_64_64_torch.float32_2> : tensor<64x64xf32>
    %cst_27 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32_1> : tensor<64xf32>
    %cst_28 = stablehlo.constant dense_resource<torch_tensor_64_64_torch.float32_1> : tensor<64x64xf32>
    %c8_i64 = arith.constant 8 : i64
    %cst_29 = stablehlo.constant dense_resource<torch_tensor_64_torch.float32> : tensor<64xf32>
    %cst_30 = stablehlo.constant dense_resource<torch_tensor_64_64_torch.float32> : tensor<64x64xf32>
    %c64_i64 = arith.constant 64 : i64
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %cst_31 = stablehlo.constant dense<0xFF800000> : tensor<f32>
    %cst_32 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %cst_33 = stablehlo.constant dense<0.000000e+00> : tensor<f64>
    %cst_34 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %cst_35 = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %cst_36 = stablehlo.constant dense<5.000000e-01> : tensor<f32>
    %cst_37 = stablehlo.constant dense<-4.000000e+00> : tensor<f32>
    %cst_38 = stablehlo.constant dense<4.000000e+00> : tensor<f32>
    %cst_39 = stablehlo.constant dense<-2.72614237E-10> : tensor<f32>
    %cst_40 = stablehlo.constant dense<2.77068146E-8> : tensor<f32>
    %cst_41 = stablehlo.constant dense<-2.10102394E-6> : tensor<f32>
    %cst_42 = stablehlo.constant dense<-5.69250624E-5> : tensor<f32>
    %cst_43 = stablehlo.constant dense<-7.34990637E-4> : tensor<f32>
    %cst_44 = stablehlo.constant dense<-2.954600e-03> : tensor<f32>
    %cst_45 = stablehlo.constant dense<-0.0160960332> : tensor<f32>
    %cst_46 = stablehlo.constant dense<-1.45660715E-5> : tensor<f32>
    %cst_47 = stablehlo.constant dense<-2.13374049E-4> : tensor<f32>
    %cst_48 = stablehlo.constant dense<-0.00168282702> : tensor<f32>
    %cst_49 = stablehlo.constant dense<-0.00737332925> : tensor<f32>
    %cst_50 = stablehlo.constant dense<-0.0142647391> : tensor<f32>
    %cst_51 = stablehlo.constant dense<-1.000000e+00> : tensor<f32>
    %cst_52 = arith.constant dense<1> : tensor<1xi64>
    %0 = shape.const_shape [64] : tensor<1xindex>
    %c8 = arith.constant 8 : index
    %cst_53 = arith.constant dense<0.35355339059327379> : tensor<1xf64>
    %cst_54 = arith.constant dense<64> : tensor<1xi64>
    %cst_55 = arith.constant dense<1.000000e-05> : tensor<1xf64>
    %1 = shape.const_shape [256] : tensor<1xindex>
    %dim = tensor.dim %arg0, %c0 : tensor<?x?x64xf32>
    %2 = arith.index_cast %dim : index to i64
    %dim_56 = tensor.dim %arg0, %c1 : tensor<?x?x64xf32>
    %3 = arith.index_cast %dim_56 : index to i64
    %4 = arith.muli %2, %3 : i64
    %from_elements = tensor.from_elements %4, %c64_i64 : tensor<2xi64>
    %5 = stablehlo.dynamic_reshape %arg0, %from_elements : (tensor<?x?x64xf32>, tensor<2xi64>) -> tensor<?x64xf32>
    %6 = stablehlo.transpose %cst_30, dims = [1, 0] : (tensor<64x64xf32>) -> tensor<64x64xf32>
    %7 = stablehlo.dot_general %5, %6, contracting_dims = [1] x [0] : (tensor<?x64xf32>, tensor<64x64xf32>) -> tensor<?x64xf32>
    %8 = stablehlo.convert %cst_52 : (tensor<1xi64>) -> tensor<1xf32>
    %9 = stablehlo.reshape %8 : (tensor<1xf32>) -> tensor<f32>
    %10 = shape.shape_of %7 : tensor<?x64xf32> -> tensor<2xindex>
    %11 = stablehlo.dynamic_broadcast_in_dim %7, %10, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %12 = stablehlo.dynamic_broadcast_in_dim %9, %10, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x64xf32>
    %13 = stablehlo.multiply %11, %12 : tensor<?x64xf32>
    %14 = stablehlo.broadcast_in_dim %9, dims = [] : (tensor<f32>) -> tensor<64xf32>
    %15 = stablehlo.multiply %14, %cst_29 : tensor<64xf32>
    %16 = shape.shape_of %13 : tensor<?x64xf32> -> tensor<2xindex>
    %17 = shape.broadcast %16, %0 : tensor<2xindex>, tensor<1xindex> -> tensor<2xindex>
    %18 = stablehlo.dynamic_broadcast_in_dim %13, %17, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %19 = stablehlo.dynamic_broadcast_in_dim %15, %17, dims = [1] : (tensor<64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %20 = stablehlo.add %18, %19 : tensor<?x64xf32>
    %from_elements_57 = tensor.from_elements %2, %3, %c64_i64 : tensor<3xi64>
    %21 = stablehlo.dynamic_reshape %20, %from_elements_57 : (tensor<?x64xf32>, tensor<3xi64>) -> tensor<?x?x64xf32>
    %22 = shape.shape_of %21 : tensor<?x?x64xf32> -> tensor<3xindex>
    %23 = shape.num_elements %22 : tensor<3xindex> -> index
    %24 = arith.index_cast %23 : index to i64
    %25 = arith.divui %24, %3 : i64
    %26 = arith.divui %25, %c8_i64 : i64
    %27 = arith.divui %26, %c8_i64 : i64
    %from_elements_58 = tensor.from_elements %27, %3, %c8_i64, %c8_i64 : tensor<4xi64>
    %28 = stablehlo.dynamic_reshape %21, %from_elements_58 : (tensor<?x?x64xf32>, tensor<4xi64>) -> tensor<?x?x8x8xf32>
    %29 = stablehlo.transpose %28, dims = [0, 2, 1, 3] : (tensor<?x?x8x8xf32>) -> tensor<?x8x?x8xf32>
    %30 = stablehlo.transpose %cst_28, dims = [1, 0] : (tensor<64x64xf32>) -> tensor<64x64xf32>
    %31 = stablehlo.dot_general %5, %30, contracting_dims = [1] x [0] : (tensor<?x64xf32>, tensor<64x64xf32>) -> tensor<?x64xf32>
    %32 = shape.shape_of %31 : tensor<?x64xf32> -> tensor<2xindex>
    %33 = stablehlo.dynamic_broadcast_in_dim %31, %32, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %34 = stablehlo.dynamic_broadcast_in_dim %9, %32, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x64xf32>
    %35 = stablehlo.multiply %33, %34 : tensor<?x64xf32>
    %36 = stablehlo.multiply %14, %cst_27 : tensor<64xf32>
    %37 = shape.shape_of %35 : tensor<?x64xf32> -> tensor<2xindex>
    %38 = shape.broadcast %37, %0 : tensor<2xindex>, tensor<1xindex> -> tensor<2xindex>
    %39 = stablehlo.dynamic_broadcast_in_dim %35, %38, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %40 = stablehlo.dynamic_broadcast_in_dim %36, %38, dims = [1] : (tensor<64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %41 = stablehlo.add %39, %40 : tensor<?x64xf32>
    %42 = stablehlo.dynamic_reshape %41, %from_elements_57 : (tensor<?x64xf32>, tensor<3xi64>) -> tensor<?x?x64xf32>
    %43 = shape.shape_of %42 : tensor<?x?x64xf32> -> tensor<3xindex>
    %44 = shape.num_elements %43 : tensor<3xindex> -> index
    %45 = arith.index_cast %44 : index to i64
    %46 = arith.divui %45, %3 : i64
    %47 = arith.divui %46, %c8_i64 : i64
    %48 = arith.divui %47, %c8_i64 : i64
    %from_elements_59 = tensor.from_elements %48, %3, %c8_i64, %c8_i64 : tensor<4xi64>
    %49 = stablehlo.dynamic_reshape %42, %from_elements_59 : (tensor<?x?x64xf32>, tensor<4xi64>) -> tensor<?x?x8x8xf32>
    %50 = stablehlo.transpose %49, dims = [0, 2, 1, 3] : (tensor<?x?x8x8xf32>) -> tensor<?x8x?x8xf32>
    %51 = stablehlo.transpose %cst_26, dims = [1, 0] : (tensor<64x64xf32>) -> tensor<64x64xf32>
    %52 = stablehlo.dot_general %5, %51, contracting_dims = [1] x [0] : (tensor<?x64xf32>, tensor<64x64xf32>) -> tensor<?x64xf32>
    %53 = shape.shape_of %52 : tensor<?x64xf32> -> tensor<2xindex>
    %54 = stablehlo.dynamic_broadcast_in_dim %52, %53, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %55 = stablehlo.dynamic_broadcast_in_dim %9, %53, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x64xf32>
    %56 = stablehlo.multiply %54, %55 : tensor<?x64xf32>
    %57 = stablehlo.multiply %14, %cst_25 : tensor<64xf32>
    %58 = shape.shape_of %56 : tensor<?x64xf32> -> tensor<2xindex>
    %59 = shape.broadcast %58, %0 : tensor<2xindex>, tensor<1xindex> -> tensor<2xindex>
    %60 = stablehlo.dynamic_broadcast_in_dim %56, %59, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %61 = stablehlo.dynamic_broadcast_in_dim %57, %59, dims = [1] : (tensor<64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %62 = stablehlo.add %60, %61 : tensor<?x64xf32>
    %63 = stablehlo.dynamic_reshape %62, %from_elements_57 : (tensor<?x64xf32>, tensor<3xi64>) -> tensor<?x?x64xf32>
    %64 = shape.shape_of %63 : tensor<?x?x64xf32> -> tensor<3xindex>
    %65 = shape.num_elements %64 : tensor<3xindex> -> index
    %66 = arith.index_cast %65 : index to i64
    %67 = arith.divui %66, %3 : i64
    %68 = arith.divui %67, %c8_i64 : i64
    %69 = arith.divui %68, %c8_i64 : i64
    %from_elements_60 = tensor.from_elements %69, %3, %c8_i64, %c8_i64 : tensor<4xi64>
    %70 = stablehlo.dynamic_reshape %63, %from_elements_60 : (tensor<?x?x64xf32>, tensor<4xi64>) -> tensor<?x?x8x8xf32>
    %71 = stablehlo.transpose %70, dims = [0, 2, 1, 3] : (tensor<?x?x8x8xf32>) -> tensor<?x8x?x8xf32>
    %72 = stablehlo.transpose %50, dims = [0, 1, 3, 2] : (tensor<?x8x?x8xf32>) -> tensor<?x8x8x?xf32>
    %73 = arith.muli %2, %c8_i64 : i64
    %from_elements_61 = tensor.from_elements %dim, %c8, %dim_56, %c8 : tensor<4xindex>
    %74 = stablehlo.dynamic_broadcast_in_dim %29, %from_elements_61, dims = [0, 1, 2, 3] : (tensor<?x8x?x8xf32>, tensor<4xindex>) -> tensor<?x8x?x8xf32>
    %from_elements_62 = tensor.from_elements %73, %3, %c8_i64 : tensor<3xi64>
    %75 = stablehlo.dynamic_reshape %74, %from_elements_62 : (tensor<?x8x?x8xf32>, tensor<3xi64>) -> tensor<?x?x8xf32>
    %from_elements_63 = tensor.from_elements %dim, %c8, %c8, %dim_56 : tensor<4xindex>
    %76 = stablehlo.dynamic_broadcast_in_dim %72, %from_elements_63, dims = [0, 1, 2, 3] : (tensor<?x8x8x?xf32>, tensor<4xindex>) -> tensor<?x8x8x?xf32>
    %from_elements_64 = tensor.from_elements %73, %c8_i64, %3 : tensor<3xi64>
    %77 = stablehlo.dynamic_reshape %76, %from_elements_64 : (tensor<?x8x8x?xf32>, tensor<3xi64>) -> tensor<?x8x?xf32>
    %dim_65 = tensor.dim %77, %c0 : tensor<?x8x?xf32>
    %dim_66 = tensor.dim %77, %c2 : tensor<?x8x?xf32>
    %from_elements_67 = tensor.from_elements %dim_65, %c8, %dim_66 : tensor<3xindex>
    %78 = stablehlo.dynamic_broadcast_in_dim %77, %from_elements_67, dims = [0, 1, 2] : (tensor<?x8x?xf32>, tensor<3xindex>) -> tensor<?x8x?xf32>
    %79 = stablehlo.dot_general %75, %78, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<?x?x8xf32>, tensor<?x8x?xf32>) -> tensor<?x?x?xf32>
    %from_elements_68 = tensor.from_elements %2, %c8_i64, %3, %3 : tensor<4xi64>
    %80 = stablehlo.dynamic_reshape %79, %from_elements_68 : (tensor<?x?x?xf32>, tensor<4xi64>) -> tensor<?x8x?x?xf32>
    %81 = stablehlo.convert %cst_53 : (tensor<1xf64>) -> tensor<1xf32>
    %82 = stablehlo.reshape %81 : (tensor<1xf32>) -> tensor<f32>
    %83 = shape.shape_of %80 : tensor<?x8x?x?xf32> -> tensor<4xindex>
    %84 = stablehlo.dynamic_broadcast_in_dim %80, %83, dims = [0, 1, 2, 3] : (tensor<?x8x?x?xf32>, tensor<4xindex>) -> tensor<?x8x?x?xf32>
    %85 = stablehlo.dynamic_broadcast_in_dim %82, %83, dims = [] : (tensor<f32>, tensor<4xindex>) -> tensor<?x8x?x?xf32>
    %86 = stablehlo.multiply %84, %85 : tensor<?x8x?x?xf32>
    %dim_69 = tensor.dim %86, %c0 : tensor<?x8x?x?xf32>
    %dim_70 = tensor.dim %86, %c2 : tensor<?x8x?x?xf32>
    %87 = stablehlo.reduce(%86 init: %cst_31) applies stablehlo.maximum across dimensions = [3] : (tensor<?x8x?x?xf32>, tensor<f32>) -> tensor<?x8x?xf32>
    %from_elements_71 = tensor.from_elements %dim_69, %c8, %dim_70, %c1 : tensor<4xindex>
    %88 = stablehlo.dynamic_reshape %87, %from_elements_71 : (tensor<?x8x?xf32>, tensor<4xindex>) -> tensor<?x8x?x1xf32>
    %89 = shape.shape_of %86 : tensor<?x8x?x?xf32> -> tensor<4xindex>
    %90 = shape.shape_of %88 : tensor<?x8x?x1xf32> -> tensor<4xindex>
    %91 = shape.cstr_broadcastable %89, %90 : tensor<4xindex>, tensor<4xindex>
    %92 = shape.assuming %91 -> (tensor<?x8x?x?xf32>) {
      %630 = shape.broadcast %89, %90 : tensor<4xindex>, tensor<4xindex> -> tensor<4xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %86, %630, dims = [0, 1, 2, 3] : (tensor<?x8x?x?xf32>, tensor<4xindex>) -> tensor<?x8x?x?xf32>
      %632 = stablehlo.dynamic_broadcast_in_dim %88, %630, dims = [0, 1, 2, 3] : (tensor<?x8x?x1xf32>, tensor<4xindex>) -> tensor<?x8x?x?xf32>
      %633 = stablehlo.subtract %631, %632 : tensor<?x8x?x?xf32>
      shape.assuming_yield %633 : tensor<?x8x?x?xf32>
    }
    %93 = stablehlo.exponential %92 : tensor<?x8x?x?xf32>
    %94 = stablehlo.reduce(%93 init: %cst_32) applies stablehlo.add across dimensions = [3] : (tensor<?x8x?x?xf32>, tensor<f32>) -> tensor<?x8x?xf32>
    %dim_72 = tensor.dim %93, %c0 : tensor<?x8x?x?xf32>
    %dim_73 = tensor.dim %93, %c2 : tensor<?x8x?x?xf32>
    %from_elements_74 = tensor.from_elements %dim_72, %c8, %dim_73, %c1 : tensor<4xindex>
    %95 = stablehlo.dynamic_reshape %94, %from_elements_74 : (tensor<?x8x?xf32>, tensor<4xindex>) -> tensor<?x8x?x1xf32>
    %96 = shape.shape_of %93 : tensor<?x8x?x?xf32> -> tensor<4xindex>
    %97 = shape.shape_of %95 : tensor<?x8x?x1xf32> -> tensor<4xindex>
    %98 = shape.cstr_broadcastable %96, %97 : tensor<4xindex>, tensor<4xindex>
    %99 = shape.assuming %98 -> (tensor<?x8x?x?xf32>) {
      %630 = shape.broadcast %96, %97 : tensor<4xindex>, tensor<4xindex> -> tensor<4xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %93, %630, dims = [0, 1, 2, 3] : (tensor<?x8x?x?xf32>, tensor<4xindex>) -> tensor<?x8x?x?xf32>
      %632 = stablehlo.dynamic_broadcast_in_dim %95, %630, dims = [0, 1, 2, 3] : (tensor<?x8x?x1xf32>, tensor<4xindex>) -> tensor<?x8x?x?xf32>
      %633 = stablehlo.divide %631, %632 : tensor<?x8x?x?xf32>
      shape.assuming_yield %633 : tensor<?x8x?x?xf32>
    }
    %from_elements_75 = tensor.from_elements %dim, %c8, %dim_56, %dim_56 : tensor<4xindex>
    %100 = stablehlo.dynamic_broadcast_in_dim %99, %from_elements_75, dims = [0, 1, 2, 3] : (tensor<?x8x?x?xf32>, tensor<4xindex>) -> tensor<?x8x?x?xf32>
    %from_elements_76 = tensor.from_elements %73, %3, %3 : tensor<3xi64>
    %101 = stablehlo.dynamic_reshape %100, %from_elements_76 : (tensor<?x8x?x?xf32>, tensor<3xi64>) -> tensor<?x?x?xf32>
    %102 = stablehlo.dynamic_broadcast_in_dim %71, %from_elements_61, dims = [0, 1, 2, 3] : (tensor<?x8x?x8xf32>, tensor<4xindex>) -> tensor<?x8x?x8xf32>
    %103 = stablehlo.dynamic_reshape %102, %from_elements_62 : (tensor<?x8x?x8xf32>, tensor<3xi64>) -> tensor<?x?x8xf32>
    %dim_77 = tensor.dim %103, %c0 : tensor<?x?x8xf32>
    %dim_78 = tensor.dim %103, %c1 : tensor<?x?x8xf32>
    %from_elements_79 = tensor.from_elements %dim_77, %dim_78, %c8 : tensor<3xindex>
    %104 = stablehlo.dynamic_broadcast_in_dim %103, %from_elements_79, dims = [0, 1, 2] : (tensor<?x?x8xf32>, tensor<3xindex>) -> tensor<?x?x8xf32>
    %105 = stablehlo.dot_general %101, %104, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<?x?x?xf32>, tensor<?x?x8xf32>) -> tensor<?x?x8xf32>
    %from_elements_80 = tensor.from_elements %2, %c8_i64, %3, %c8_i64 : tensor<4xi64>
    %106 = stablehlo.dynamic_reshape %105, %from_elements_80 : (tensor<?x?x8xf32>, tensor<4xi64>) -> tensor<?x8x?x8xf32>
    %107 = stablehlo.transpose %106, dims = [0, 2, 1, 3] : (tensor<?x8x?x8xf32>) -> tensor<?x?x8x8xf32>
    %108 = shape.shape_of %107 : tensor<?x?x8x8xf32> -> tensor<4xindex>
    %109 = shape.num_elements %108 : tensor<4xindex> -> index
    %110 = arith.index_cast %109 : index to i64
    %111 = arith.divui %110, %3 : i64
    %112 = arith.divui %111, %c64_i64 : i64
    %from_elements_81 = tensor.from_elements %112, %3, %c64_i64 : tensor<3xi64>
    %113 = stablehlo.dynamic_reshape %107, %from_elements_81 : (tensor<?x?x8x8xf32>, tensor<3xi64>) -> tensor<?x?x64xf32>
    %114 = stablehlo.dynamic_reshape %113, %from_elements : (tensor<?x?x64xf32>, tensor<2xi64>) -> tensor<?x64xf32>
    %115 = stablehlo.transpose %cst_24, dims = [1, 0] : (tensor<64x64xf32>) -> tensor<64x64xf32>
    %116 = stablehlo.dot_general %114, %115, contracting_dims = [1] x [0] : (tensor<?x64xf32>, tensor<64x64xf32>) -> tensor<?x64xf32>
    %117 = shape.shape_of %116 : tensor<?x64xf32> -> tensor<2xindex>
    %118 = stablehlo.dynamic_broadcast_in_dim %116, %117, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %119 = stablehlo.dynamic_broadcast_in_dim %9, %117, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x64xf32>
    %120 = stablehlo.multiply %118, %119 : tensor<?x64xf32>
    %121 = stablehlo.multiply %14, %cst_23 : tensor<64xf32>
    %122 = shape.shape_of %120 : tensor<?x64xf32> -> tensor<2xindex>
    %123 = shape.broadcast %122, %0 : tensor<2xindex>, tensor<1xindex> -> tensor<2xindex>
    %124 = stablehlo.dynamic_broadcast_in_dim %120, %123, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %125 = stablehlo.dynamic_broadcast_in_dim %121, %123, dims = [1] : (tensor<64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %126 = stablehlo.add %124, %125 : tensor<?x64xf32>
    %127 = stablehlo.dynamic_reshape %126, %from_elements_57 : (tensor<?x64xf32>, tensor<3xi64>) -> tensor<?x?x64xf32>
    %128 = shape.shape_of %127 : tensor<?x?x64xf32> -> tensor<3xindex>
    %129 = shape.shape_of %arg0 : tensor<?x?x64xf32> -> tensor<3xindex>
    %130 = shape.cstr_broadcastable %128, %129 : tensor<3xindex>, tensor<3xindex>
    %131 = shape.assuming %130 -> (tensor<?x?x64xf32>) {
      %630 = shape.broadcast %128, %129 : tensor<3xindex>, tensor<3xindex> -> tensor<3xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %127, %630, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %632 = stablehlo.dynamic_broadcast_in_dim %arg0, %630, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %633 = stablehlo.add %631, %632 : tensor<?x?x64xf32>
      shape.assuming_yield %633 : tensor<?x?x64xf32>
    }
    %132 = stablehlo.convert %131 : (tensor<?x?x64xf32>) -> tensor<?x?x64xf64>
    %133 = stablehlo.reduce(%132 init: %cst_33) applies stablehlo.add across dimensions = [2] : (tensor<?x?x64xf64>, tensor<f64>) -> tensor<?x?xf64>
    %dim_82 = tensor.dim %132, %c0 : tensor<?x?x64xf64>
    %dim_83 = tensor.dim %132, %c1 : tensor<?x?x64xf64>
    %from_elements_84 = tensor.from_elements %dim_82, %dim_83, %c1 : tensor<3xindex>
    %134 = stablehlo.dynamic_reshape %133, %from_elements_84 : (tensor<?x?xf64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %135 = stablehlo.convert %cst_54 : (tensor<1xi64>) -> tensor<1xf64>
    %136 = stablehlo.reshape %135 : (tensor<1xf64>) -> tensor<f64>
    %137 = shape.shape_of %134 : tensor<?x?x1xf64> -> tensor<3xindex>
    %138 = stablehlo.dynamic_broadcast_in_dim %134, %137, dims = [0, 1, 2] : (tensor<?x?x1xf64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %139 = stablehlo.dynamic_broadcast_in_dim %136, %137, dims = [] : (tensor<f64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %140 = stablehlo.divide %138, %139 : tensor<?x?x1xf64>
    %141 = shape.shape_of %132 : tensor<?x?x64xf64> -> tensor<3xindex>
    %142 = shape.shape_of %140 : tensor<?x?x1xf64> -> tensor<3xindex>
    %143 = shape.cstr_broadcastable %141, %142 : tensor<3xindex>, tensor<3xindex>
    %144 = shape.assuming %143 -> (tensor<?x?x64xf64>) {
      %630 = shape.broadcast %141, %142 : tensor<3xindex>, tensor<3xindex> -> tensor<3xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %132, %630, dims = [0, 1, 2] : (tensor<?x?x64xf64>, tensor<3xindex>) -> tensor<?x?x64xf64>
      %632 = stablehlo.dynamic_broadcast_in_dim %140, %630, dims = [0, 1, 2] : (tensor<?x?x1xf64>, tensor<3xindex>) -> tensor<?x?x64xf64>
      %633 = stablehlo.subtract %631, %632 : tensor<?x?x64xf64>
      shape.assuming_yield %633 : tensor<?x?x64xf64>
    }
    %145 = shape.shape_of %144 : tensor<?x?x64xf64> -> tensor<3xindex>
    %146 = stablehlo.dynamic_broadcast_in_dim %144, %145, dims = [0, 1, 2] : (tensor<?x?x64xf64>, tensor<3xindex>) -> tensor<?x?x64xf64>
    %147 = stablehlo.multiply %146, %146 : tensor<?x?x64xf64>
    %148 = stablehlo.reduce(%147 init: %cst_33) applies stablehlo.add across dimensions = [2] : (tensor<?x?x64xf64>, tensor<f64>) -> tensor<?x?xf64>
    %dim_85 = tensor.dim %147, %c0 : tensor<?x?x64xf64>
    %dim_86 = tensor.dim %147, %c1 : tensor<?x?x64xf64>
    %from_elements_87 = tensor.from_elements %dim_85, %dim_86, %c1 : tensor<3xindex>
    %149 = stablehlo.dynamic_reshape %148, %from_elements_87 : (tensor<?x?xf64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %150 = shape.shape_of %149 : tensor<?x?x1xf64> -> tensor<3xindex>
    %151 = stablehlo.dynamic_broadcast_in_dim %149, %150, dims = [0, 1, 2] : (tensor<?x?x1xf64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %152 = stablehlo.dynamic_broadcast_in_dim %136, %150, dims = [] : (tensor<f64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %153 = stablehlo.divide %151, %152 : tensor<?x?x1xf64>
    %154 = stablehlo.convert %153 : (tensor<?x?x1xf64>) -> tensor<?x?x1xf32>
    %155 = stablehlo.reduce(%131 init: %cst_32) applies stablehlo.add across dimensions = [2] : (tensor<?x?x64xf32>, tensor<f32>) -> tensor<?x?xf32>
    %dim_88 = tensor.dim %131, %c0 : tensor<?x?x64xf32>
    %dim_89 = tensor.dim %131, %c1 : tensor<?x?x64xf32>
    %from_elements_90 = tensor.from_elements %dim_88, %dim_89, %c1 : tensor<3xindex>
    %156 = stablehlo.dynamic_reshape %155, %from_elements_90 : (tensor<?x?xf32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %157 = stablehlo.convert %cst_54 : (tensor<1xi64>) -> tensor<1xf32>
    %158 = stablehlo.reshape %157 : (tensor<1xf32>) -> tensor<f32>
    %159 = shape.shape_of %156 : tensor<?x?x1xf32> -> tensor<3xindex>
    %160 = stablehlo.dynamic_broadcast_in_dim %156, %159, dims = [0, 1, 2] : (tensor<?x?x1xf32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %161 = stablehlo.dynamic_broadcast_in_dim %158, %159, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %162 = stablehlo.divide %160, %161 : tensor<?x?x1xf32>
    %163 = stablehlo.convert %cst_55 : (tensor<1xf64>) -> tensor<1xf32>
    %164 = stablehlo.reshape %163 : (tensor<1xf32>) -> tensor<f32>
    %165 = shape.shape_of %154 : tensor<?x?x1xf32> -> tensor<3xindex>
    %166 = stablehlo.dynamic_broadcast_in_dim %154, %165, dims = [0, 1, 2] : (tensor<?x?x1xf32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %167 = stablehlo.dynamic_broadcast_in_dim %164, %165, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %168 = stablehlo.add %166, %167 : tensor<?x?x1xf32>
    %169 = stablehlo.rsqrt %168 : tensor<?x?x1xf32>
    %170 = shape.shape_of %131 : tensor<?x?x64xf32> -> tensor<3xindex>
    %171 = shape.shape_of %162 : tensor<?x?x1xf32> -> tensor<3xindex>
    %172 = shape.cstr_broadcastable %170, %171 : tensor<3xindex>, tensor<3xindex>
    %173 = shape.assuming %172 -> (tensor<?x?x64xf32>) {
      %630 = shape.broadcast %170, %171 : tensor<3xindex>, tensor<3xindex> -> tensor<3xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %131, %630, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %632 = stablehlo.dynamic_broadcast_in_dim %162, %630, dims = [0, 1, 2] : (tensor<?x?x1xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %633 = stablehlo.subtract %631, %632 : tensor<?x?x64xf32>
      shape.assuming_yield %633 : tensor<?x?x64xf32>
    }
    %174 = shape.shape_of %173 : tensor<?x?x64xf32> -> tensor<3xindex>
    %175 = shape.shape_of %169 : tensor<?x?x1xf32> -> tensor<3xindex>
    %176 = shape.cstr_broadcastable %174, %175 : tensor<3xindex>, tensor<3xindex>
    %177 = shape.assuming %176 -> (tensor<?x?x64xf32>) {
      %630 = shape.broadcast %174, %175 : tensor<3xindex>, tensor<3xindex> -> tensor<3xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %173, %630, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %632 = stablehlo.dynamic_broadcast_in_dim %169, %630, dims = [0, 1, 2] : (tensor<?x?x1xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %633 = stablehlo.multiply %631, %632 : tensor<?x?x64xf32>
      shape.assuming_yield %633 : tensor<?x?x64xf32>
    }
    %178 = shape.shape_of %177 : tensor<?x?x64xf32> -> tensor<3xindex>
    %179 = shape.broadcast %178, %0 : tensor<3xindex>, tensor<1xindex> -> tensor<3xindex>
    %180 = stablehlo.dynamic_broadcast_in_dim %177, %179, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
    %181 = stablehlo.dynamic_broadcast_in_dim %cst_22, %179, dims = [2] : (tensor<64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
    %182 = stablehlo.multiply %180, %181 : tensor<?x?x64xf32>
    %183 = shape.shape_of %182 : tensor<?x?x64xf32> -> tensor<3xindex>
    %184 = shape.broadcast %183, %0 : tensor<3xindex>, tensor<1xindex> -> tensor<3xindex>
    %185 = stablehlo.dynamic_broadcast_in_dim %182, %184, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
    %186 = stablehlo.dynamic_broadcast_in_dim %cst_21, %184, dims = [2] : (tensor<64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
    %187 = stablehlo.add %185, %186 : tensor<?x?x64xf32>
    %188 = stablehlo.dynamic_reshape %187, %from_elements : (tensor<?x?x64xf32>, tensor<2xi64>) -> tensor<?x64xf32>
    %189 = stablehlo.transpose %cst_20, dims = [1, 0] : (tensor<256x64xf32>) -> tensor<64x256xf32>
    %190 = stablehlo.dot_general %188, %189, contracting_dims = [1] x [0] : (tensor<?x64xf32>, tensor<64x256xf32>) -> tensor<?x256xf32>
    %191 = shape.shape_of %190 : tensor<?x256xf32> -> tensor<2xindex>
    %192 = stablehlo.dynamic_broadcast_in_dim %190, %191, dims = [0, 1] : (tensor<?x256xf32>, tensor<2xindex>) -> tensor<?x256xf32>
    %193 = stablehlo.dynamic_broadcast_in_dim %9, %191, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x256xf32>
    %194 = stablehlo.multiply %192, %193 : tensor<?x256xf32>
    %195 = stablehlo.broadcast_in_dim %9, dims = [] : (tensor<f32>) -> tensor<256xf32>
    %196 = stablehlo.multiply %195, %cst_19 : tensor<256xf32>
    %197 = shape.shape_of %194 : tensor<?x256xf32> -> tensor<2xindex>
    %198 = shape.broadcast %197, %1 : tensor<2xindex>, tensor<1xindex> -> tensor<2xindex>
    %199 = stablehlo.dynamic_broadcast_in_dim %194, %198, dims = [0, 1] : (tensor<?x256xf32>, tensor<2xindex>) -> tensor<?x256xf32>
    %200 = stablehlo.dynamic_broadcast_in_dim %196, %198, dims = [1] : (tensor<256xf32>, tensor<2xindex>) -> tensor<?x256xf32>
    %201 = stablehlo.add %199, %200 : tensor<?x256xf32>
    %from_elements_91 = tensor.from_elements %2, %3, %c256_i64 : tensor<3xi64>
    %202 = stablehlo.dynamic_reshape %201, %from_elements_91 : (tensor<?x256xf32>, tensor<3xi64>) -> tensor<?x?x256xf32>
    %203 = shape.shape_of %202 : tensor<?x?x256xf32> -> tensor<3xindex>
    %204 = stablehlo.dynamic_broadcast_in_dim %cst_34, %203, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %205 = stablehlo.dynamic_broadcast_in_dim %cst_35, %203, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %206 = stablehlo.dynamic_broadcast_in_dim %cst_36, %203, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %207 = stablehlo.multiply %202, %206 : tensor<?x?x256xf32>
    %208 = stablehlo.rsqrt %205 : tensor<?x?x256xf32>
    %209 = stablehlo.multiply %202, %208 : tensor<?x?x256xf32>
    %210 = shape.shape_of %209 : tensor<?x?x256xf32> -> tensor<3xindex>
    %211 = stablehlo.dynamic_broadcast_in_dim %cst_37, %210, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %212 = stablehlo.dynamic_broadcast_in_dim %cst_38, %210, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %213 = stablehlo.clamp %211, %209, %212 : tensor<?x?x256xf32>
    %214 = stablehlo.multiply %213, %213 : tensor<?x?x256xf32>
    %215 = shape.shape_of %214 : tensor<?x?x256xf32> -> tensor<3xindex>
    %216 = stablehlo.dynamic_broadcast_in_dim %cst_39, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %217 = stablehlo.multiply %216, %214 : tensor<?x?x256xf32>
    %218 = stablehlo.dynamic_broadcast_in_dim %cst_40, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %219 = stablehlo.add %217, %218 : tensor<?x?x256xf32>
    %220 = stablehlo.multiply %219, %214 : tensor<?x?x256xf32>
    %221 = stablehlo.dynamic_broadcast_in_dim %cst_41, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %222 = stablehlo.add %220, %221 : tensor<?x?x256xf32>
    %223 = stablehlo.multiply %222, %214 : tensor<?x?x256xf32>
    %224 = stablehlo.dynamic_broadcast_in_dim %cst_42, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %225 = stablehlo.add %223, %224 : tensor<?x?x256xf32>
    %226 = stablehlo.multiply %225, %214 : tensor<?x?x256xf32>
    %227 = stablehlo.dynamic_broadcast_in_dim %cst_43, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %228 = stablehlo.add %226, %227 : tensor<?x?x256xf32>
    %229 = stablehlo.multiply %228, %214 : tensor<?x?x256xf32>
    %230 = stablehlo.dynamic_broadcast_in_dim %cst_44, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %231 = stablehlo.add %229, %230 : tensor<?x?x256xf32>
    %232 = stablehlo.multiply %231, %214 : tensor<?x?x256xf32>
    %233 = stablehlo.dynamic_broadcast_in_dim %cst_45, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %234 = stablehlo.add %232, %233 : tensor<?x?x256xf32>
    %235 = stablehlo.dynamic_broadcast_in_dim %cst_46, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %236 = stablehlo.multiply %235, %214 : tensor<?x?x256xf32>
    %237 = stablehlo.dynamic_broadcast_in_dim %cst_47, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %238 = stablehlo.add %236, %237 : tensor<?x?x256xf32>
    %239 = stablehlo.multiply %238, %214 : tensor<?x?x256xf32>
    %240 = stablehlo.dynamic_broadcast_in_dim %cst_48, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %241 = stablehlo.add %239, %240 : tensor<?x?x256xf32>
    %242 = stablehlo.multiply %241, %214 : tensor<?x?x256xf32>
    %243 = stablehlo.dynamic_broadcast_in_dim %cst_49, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %244 = stablehlo.add %242, %243 : tensor<?x?x256xf32>
    %245 = stablehlo.multiply %244, %214 : tensor<?x?x256xf32>
    %246 = stablehlo.dynamic_broadcast_in_dim %cst_50, %215, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %247 = stablehlo.add %245, %246 : tensor<?x?x256xf32>
    %248 = stablehlo.multiply %213, %234 : tensor<?x?x256xf32>
    %249 = stablehlo.divide %248, %247 : tensor<?x?x256xf32>
    %250 = shape.shape_of %213 : tensor<?x?x256xf32> -> tensor<3xindex>
    %251 = stablehlo.dynamic_broadcast_in_dim %cst_51, %250, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %252 = stablehlo.dynamic_broadcast_in_dim %cst_34, %250, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x256xf32>
    %253 = stablehlo.clamp %251, %249, %252 : tensor<?x?x256xf32>
    %254 = stablehlo.add %253, %204 : tensor<?x?x256xf32>
    %255 = stablehlo.multiply %254, %207 : tensor<?x?x256xf32>
    %from_elements_92 = tensor.from_elements %4, %c256_i64 : tensor<2xi64>
    %256 = stablehlo.dynamic_reshape %255, %from_elements_92 : (tensor<?x?x256xf32>, tensor<2xi64>) -> tensor<?x256xf32>
    %257 = stablehlo.transpose %cst_18, dims = [1, 0] : (tensor<64x256xf32>) -> tensor<256x64xf32>
    %258 = stablehlo.dot_general %256, %257, contracting_dims = [1] x [0] : (tensor<?x256xf32>, tensor<256x64xf32>) -> tensor<?x64xf32>
    %259 = shape.shape_of %258 : tensor<?x64xf32> -> tensor<2xindex>
    %260 = stablehlo.dynamic_broadcast_in_dim %258, %259, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %261 = stablehlo.dynamic_broadcast_in_dim %9, %259, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x64xf32>
    %262 = stablehlo.multiply %260, %261 : tensor<?x64xf32>
    %263 = stablehlo.multiply %14, %cst_17 : tensor<64xf32>
    %264 = shape.shape_of %262 : tensor<?x64xf32> -> tensor<2xindex>
    %265 = shape.broadcast %264, %0 : tensor<2xindex>, tensor<1xindex> -> tensor<2xindex>
    %266 = stablehlo.dynamic_broadcast_in_dim %262, %265, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %267 = stablehlo.dynamic_broadcast_in_dim %263, %265, dims = [1] : (tensor<64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %268 = stablehlo.add %266, %267 : tensor<?x64xf32>
    %269 = stablehlo.dynamic_reshape %268, %from_elements_57 : (tensor<?x64xf32>, tensor<3xi64>) -> tensor<?x?x64xf32>
    %270 = shape.shape_of %269 : tensor<?x?x64xf32> -> tensor<3xindex>
    %271 = shape.shape_of %187 : tensor<?x?x64xf32> -> tensor<3xindex>
    %272 = shape.cstr_broadcastable %270, %271 : tensor<3xindex>, tensor<3xindex>
    %273 = shape.assuming %272 -> (tensor<?x?x64xf32>) {
      %630 = shape.broadcast %270, %271 : tensor<3xindex>, tensor<3xindex> -> tensor<3xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %269, %630, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %632 = stablehlo.dynamic_broadcast_in_dim %187, %630, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %633 = stablehlo.add %631, %632 : tensor<?x?x64xf32>
      shape.assuming_yield %633 : tensor<?x?x64xf32>
    }
    %274 = stablehlo.convert %273 : (tensor<?x?x64xf32>) -> tensor<?x?x64xf64>
    %275 = stablehlo.reduce(%274 init: %cst_33) applies stablehlo.add across dimensions = [2] : (tensor<?x?x64xf64>, tensor<f64>) -> tensor<?x?xf64>
    %dim_93 = tensor.dim %274, %c0 : tensor<?x?x64xf64>
    %dim_94 = tensor.dim %274, %c1 : tensor<?x?x64xf64>
    %from_elements_95 = tensor.from_elements %dim_93, %dim_94, %c1 : tensor<3xindex>
    %276 = stablehlo.dynamic_reshape %275, %from_elements_95 : (tensor<?x?xf64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %277 = shape.shape_of %276 : tensor<?x?x1xf64> -> tensor<3xindex>
    %278 = stablehlo.dynamic_broadcast_in_dim %276, %277, dims = [0, 1, 2] : (tensor<?x?x1xf64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %279 = stablehlo.dynamic_broadcast_in_dim %136, %277, dims = [] : (tensor<f64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %280 = stablehlo.divide %278, %279 : tensor<?x?x1xf64>
    %281 = shape.shape_of %274 : tensor<?x?x64xf64> -> tensor<3xindex>
    %282 = shape.shape_of %280 : tensor<?x?x1xf64> -> tensor<3xindex>
    %283 = shape.cstr_broadcastable %281, %282 : tensor<3xindex>, tensor<3xindex>
    %284 = shape.assuming %283 -> (tensor<?x?x64xf64>) {
      %630 = shape.broadcast %281, %282 : tensor<3xindex>, tensor<3xindex> -> tensor<3xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %274, %630, dims = [0, 1, 2] : (tensor<?x?x64xf64>, tensor<3xindex>) -> tensor<?x?x64xf64>
      %632 = stablehlo.dynamic_broadcast_in_dim %280, %630, dims = [0, 1, 2] : (tensor<?x?x1xf64>, tensor<3xindex>) -> tensor<?x?x64xf64>
      %633 = stablehlo.subtract %631, %632 : tensor<?x?x64xf64>
      shape.assuming_yield %633 : tensor<?x?x64xf64>
    }
    %285 = shape.shape_of %284 : tensor<?x?x64xf64> -> tensor<3xindex>
    %286 = stablehlo.dynamic_broadcast_in_dim %284, %285, dims = [0, 1, 2] : (tensor<?x?x64xf64>, tensor<3xindex>) -> tensor<?x?x64xf64>
    %287 = stablehlo.multiply %286, %286 : tensor<?x?x64xf64>
    %288 = stablehlo.reduce(%287 init: %cst_33) applies stablehlo.add across dimensions = [2] : (tensor<?x?x64xf64>, tensor<f64>) -> tensor<?x?xf64>
    %dim_96 = tensor.dim %287, %c0 : tensor<?x?x64xf64>
    %dim_97 = tensor.dim %287, %c1 : tensor<?x?x64xf64>
    %from_elements_98 = tensor.from_elements %dim_96, %dim_97, %c1 : tensor<3xindex>
    %289 = stablehlo.dynamic_reshape %288, %from_elements_98 : (tensor<?x?xf64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %290 = shape.shape_of %289 : tensor<?x?x1xf64> -> tensor<3xindex>
    %291 = stablehlo.dynamic_broadcast_in_dim %289, %290, dims = [0, 1, 2] : (tensor<?x?x1xf64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %292 = stablehlo.dynamic_broadcast_in_dim %136, %290, dims = [] : (tensor<f64>, tensor<3xindex>) -> tensor<?x?x1xf64>
    %293 = stablehlo.divide %291, %292 : tensor<?x?x1xf64>
    %294 = stablehlo.convert %293 : (tensor<?x?x1xf64>) -> tensor<?x?x1xf32>
    %295 = stablehlo.reduce(%273 init: %cst_32) applies stablehlo.add across dimensions = [2] : (tensor<?x?x64xf32>, tensor<f32>) -> tensor<?x?xf32>
    %dim_99 = tensor.dim %273, %c0 : tensor<?x?x64xf32>
    %dim_100 = tensor.dim %273, %c1 : tensor<?x?x64xf32>
    %from_elements_101 = tensor.from_elements %dim_99, %dim_100, %c1 : tensor<3xindex>
    %296 = stablehlo.dynamic_reshape %295, %from_elements_101 : (tensor<?x?xf32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %297 = shape.shape_of %296 : tensor<?x?x1xf32> -> tensor<3xindex>
    %298 = stablehlo.dynamic_broadcast_in_dim %296, %297, dims = [0, 1, 2] : (tensor<?x?x1xf32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %299 = stablehlo.dynamic_broadcast_in_dim %158, %297, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %300 = stablehlo.divide %298, %299 : tensor<?x?x1xf32>
    %301 = shape.shape_of %294 : tensor<?x?x1xf32> -> tensor<3xindex>
    %302 = stablehlo.dynamic_broadcast_in_dim %294, %301, dims = [0, 1, 2] : (tensor<?x?x1xf32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %303 = stablehlo.dynamic_broadcast_in_dim %164, %301, dims = [] : (tensor<f32>, tensor<3xindex>) -> tensor<?x?x1xf32>
    %304 = stablehlo.add %302, %303 : tensor<?x?x1xf32>
    %305 = stablehlo.rsqrt %304 : tensor<?x?x1xf32>
    %306 = shape.shape_of %273 : tensor<?x?x64xf32> -> tensor<3xindex>
    %307 = shape.shape_of %300 : tensor<?x?x1xf32> -> tensor<3xindex>
    %308 = shape.cstr_broadcastable %306, %307 : tensor<3xindex>, tensor<3xindex>
    %309 = shape.assuming %308 -> (tensor<?x?x64xf32>) {
      %630 = shape.broadcast %306, %307 : tensor<3xindex>, tensor<3xindex> -> tensor<3xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %273, %630, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %632 = stablehlo.dynamic_broadcast_in_dim %300, %630, dims = [0, 1, 2] : (tensor<?x?x1xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %633 = stablehlo.subtract %631, %632 : tensor<?x?x64xf32>
      shape.assuming_yield %633 : tensor<?x?x64xf32>
    }
    %310 = shape.shape_of %309 : tensor<?x?x64xf32> -> tensor<3xindex>
    %311 = shape.shape_of %305 : tensor<?x?x1xf32> -> tensor<3xindex>
    %312 = shape.cstr_broadcastable %310, %311 : tensor<3xindex>, tensor<3xindex>
    %313 = shape.assuming %312 -> (tensor<?x?x64xf32>) {
      %630 = shape.broadcast %310, %311 : tensor<3xindex>, tensor<3xindex> -> tensor<3xindex>
      %631 = stablehlo.dynamic_broadcast_in_dim %309, %630, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %632 = stablehlo.dynamic_broadcast_in_dim %305, %630, dims = [0, 1, 2] : (tensor<?x?x1xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
      %633 = stablehlo.multiply %631, %632 : tensor<?x?x64xf32>
      shape.assuming_yield %633 : tensor<?x?x64xf32>
    }
    %314 = shape.shape_of %313 : tensor<?x?x64xf32> -> tensor<3xindex>
    %315 = shape.broadcast %314, %0 : tensor<3xindex>, tensor<1xindex> -> tensor<3xindex>
    %316 = stablehlo.dynamic_broadcast_in_dim %313, %315, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
    %317 = stablehlo.dynamic_broadcast_in_dim %cst_16, %315, dims = [2] : (tensor<64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
    %318 = stablehlo.multiply %316, %317 : tensor<?x?x64xf32>
    %319 = shape.shape_of %318 : tensor<?x?x64xf32> -> tensor<3xindex>
    %320 = shape.broadcast %319, %0 : tensor<3xindex>, tensor<1xindex> -> tensor<3xindex>
    %321 = stablehlo.dynamic_broadcast_in_dim %318, %320, dims = [0, 1, 2] : (tensor<?x?x64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
    %322 = stablehlo.dynamic_broadcast_in_dim %cst_15, %320, dims = [2] : (tensor<64xf32>, tensor<3xindex>) -> tensor<?x?x64xf32>
    %323 = stablehlo.add %321, %322 : tensor<?x?x64xf32>
    %324 = stablehlo.dynamic_reshape %323, %from_elements : (tensor<?x?x64xf32>, tensor<2xi64>) -> tensor<?x64xf32>
    %325 = stablehlo.transpose %cst_14, dims = [1, 0] : (tensor<64x64xf32>) -> tensor<64x64xf32>
    %326 = stablehlo.dot_general %324, %325, contracting_dims = [1] x [0] : (tensor<?x64xf32>, tensor<64x64xf32>) -> tensor<?x64xf32>
    %327 = shape.shape_of %326 : tensor<?x64xf32> -> tensor<2xindex>
    %328 = stablehlo.dynamic_broadcast_in_dim %326, %327, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %329 = stablehlo.dynamic_broadcast_in_dim %9, %327, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x64xf32>
    %330 = stablehlo.multiply %328, %329 : tensor<?x64xf32>
    %331 = stablehlo.multiply %14, %cst_13 : tensor<64xf32>
    %332 = shape.shape_of %330 : tensor<?x64xf32> -> tensor<2xindex>
    %333 = shape.broadcast %332, %0 : tensor<2xindex>, tensor<1xindex> -> tensor<2xindex>
    %334 = stablehlo.dynamic_broadcast_in_dim %330, %333, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %335 = stablehlo.dynamic_broadcast_in_dim %331, %333, dims = [1] : (tensor<64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %336 = stablehlo.add %334, %335 : tensor<?x64xf32>
    %337 = stablehlo.dynamic_reshape %336, %from_elements_57 : (tensor<?x64xf32>, tensor<3xi64>) -> tensor<?x?x64xf32>
    %338 = shape.shape_of %337 : tensor<?x?x64xf32> -> tensor<3xindex>
    %339 = shape.num_elements %338 : tensor<3xindex> -> index
    %340 = arith.index_cast %339 : index to i64
    %341 = arith.divui %340, %3 : i64
    %342 = arith.divui %341, %c8_i64 : i64
    %343 = arith.divui %342, %c8_i64 : i64
    %from_elements_102 = tensor.from_elements %343, %3, %c8_i64, %c8_i64 : tensor<4xi64>
    %344 = stablehlo.dynamic_reshape %337, %from_elements_102 : (tensor<?x?x64xf32>, tensor<4xi64>) -> tensor<?x?x8x8xf32>
    %345 = stablehlo.transpose %344, dims = [0, 2, 1, 3] : (tensor<?x?x8x8xf32>) -> tensor<?x8x?x8xf32>
    %346 = stablehlo.transpose %cst_12, dims = [1, 0] : (tensor<64x64xf32>) -> tensor<64x64xf32>
    %347 = stablehlo.dot_general %324, %346, contracting_dims = [1] x [0] : (tensor<?x64xf32>, tensor<64x64xf32>) -> tensor<?x64xf32>
    %348 = shape.shape_of %347 : tensor<?x64xf32> -> tensor<2xindex>
    %349 = stablehlo.dynamic_broadcast_in_dim %347, %348, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %350 = stablehlo.dynamic_broadcast_in_dim %9, %348, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x64xf32>
    %351 = stablehlo.multiply %349, %350 : tensor<?x64xf32>
    %352 = stablehlo.multiply %14, %cst_11 : tensor<64xf32>
    %353 = shape.shape_of %351 : tensor<?x64xf32> -> tensor<2xindex>
    %354 = shape.broadcast %353, %0 : tensor<2xindex>, tensor<1xindex> -> tensor<2xindex>
    %355 = stablehlo.dynamic_broadcast_in_dim %351, %354, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %356 = stablehlo.dynamic_broadcast_in_dim %352, %354, dims = [1] : (tensor<64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %357 = stablehlo.add %355, %356 : tensor<?x64xf32>
    %358 = stablehlo.dynamic_reshape %357, %from_elements_57 : (tensor<?x64xf32>, tensor<3xi64>) -> tensor<?x?x64xf32>
    %359 = shape.shape_of %358 : tensor<?x?x64xf32> -> tensor<3xindex>
    %360 = shape.num_elements %359 : tensor<3xindex> -> index
    %361 = arith.index_cast %360 : index to i64
    %362 = arith.divui %361, %3 : i64
    %363 = arith.divui %362, %c8_i64 : i64
    %364 = arith.divui %363, %c8_i64 : i64
    %from_elements_103 = tensor.from_elements %364, %3, %c8_i64, %c8_i64 : tensor<4xi64>
    %365 = stablehlo.dynamic_reshape %358, %from_elements_103 : (tensor<?x?x64xf32>, tensor<4xi64>) -> tensor<?x?x8x8xf32>
    %366 = stablehlo.transpose %365, dims = [0, 2, 1, 3] : (tensor<?x?x8x8xf32>) -> tensor<?x8x?x8xf32>
    %367 = stablehlo.transpose %cst_10, dims = [1, 0] : (tensor<64x64xf32>) -> tensor<64x64xf32>
    %368 = stablehlo.dot_general %324, %367, contracting_dims = [1] x [0] : (tensor<?x64xf32>, tensor<64x64xf32>) -> tensor<?x64xf32>
    %369 = shape.shape_of %368 : tensor<?x64xf32> -> tensor<2xindex>
    %370 = stablehlo.dynamic_broadcast_in_dim %368, %369, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %371 = stablehlo.dynamic_broadcast_in_dim %9, %369, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x64xf32>
    %372 = stablehlo.multiply %370, %371 : tensor<?x64xf32>
    %373 = stablehlo.multiply %14, %cst_9 : tensor<64xf32>
    %374 = shape.shape_of %372 : tensor<?x64xf32> -> tensor<2xindex>
    %375 = shape.broadcast %374, %0 : tensor<2xindex>, tensor<1xindex> -> tensor<2xindex>
    %376 = stablehlo.dynamic_broadcast_in_dim %372, %375, dims = [0, 1] : (tensor<?x64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %377 = stablehlo.dynamic_broadcast_in_dim %373, %375, dims = [1] : (tensor<64xf32>, tensor<2xindex>) -> tensor<?x64xf32>
    %378 = stablehlo.add %376, %377 : tensor<?x64xf32>
    %379 = stablehlo.dynamic_reshape %378, %from_elements_57 : (tensor<?x64xf32>, tensor<3xi64>) -> tensor<?x?x64xf32>
    %380 = shape.shape_of %379 : tensor<?x?x64xf32> -> tensor<3xindex>
    %381 = shape.num_elements %380 : tensor<3xindex> -> index
    %382 = arith.index_cast %381 : index to i64
    %383 = arith.divui %382, %3 : i64
    %384 = arith.divui %383, %c8_i64 : i64
    %385 = arith.divui %384, %c8_i64 : i64
    %from_elements_104 = tensor.from_elements %385, %3, %c8_i64, %c8_i64 : tensor<4xi64>
    %386 = stablehlo.dynamic_reshape %379, %from_elements_104 : (tensor<?x?x64xf32>, tensor<4xi64>) -> tensor<?x?x8x8xf32>
    %387 = stablehlo.transpose %386, dims = [0, 2, 1, 3] : (tensor<?x?x8x8xf32>) -> tensor<?x8x?x8xf32>
    %388 = stablehlo.transpose %366, dims = [0, 1, 3, 2] : (tensor<?x8x?x8xf32>) -> tensor<?x8x8x?xf32>
    %389 = stablehlo.dynamic_broadcast_in_dim %345, %from_elements_61, dims = [0, 1, 2, 3] : (tensor<?x8x?x8xf32>, tensor<4xindex>) -> tensor<?x8x?x8xf32>
    %390 = stablehlo.dynamic_reshape %389, %from_elements_62 : (tensor<?x8x?x8xf32>, tensor<3xi64>) -> tensor<?x?x8xf32>
    %391 = stablehlo.dynamic_broadcast_in_dim %388, %from_elements_63, dims = [0, 1, 2, 3] : (tensor<?x8x8x?xf32>, tensor<4xindex>) -> tensor<?x8x8x?xf32>
    %392 = stablehlo.dynamic_reshape %391, %from_elements_64 : (tensor<?x8x8x?xf32>, tensor<3xi64>) -> tensor<?x8x?xf32>
    %dim_105 = tensor.dim %392, %c0 : tensor<?x8x?xf32>
    %dim_106 = tensor.dim %392, %c2 : tensor<?x8x?xf32>
    %from_elements_107 = tensor.from_elements %dim_105, %c8, %dim_106 : tensor<3xindex>
    %393 = stablehlo.dynamic_broadcast_in_dim %392, %from_elements_107, dims = [0, 1, 2] : (tensor<?x8x?xf32>, tensor<3xindex>) -> tensor<?x8x?xf32>
    %394 = stablehlo.dot_general %390, %393, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<?x?x8xf32>, tensor<?x8x?xf32>) -> tensor<?x?x?xf32>
    %395 = stablehlo.dynamic_reshape %394, %from_elements_68 : (tensor<?x?x?xf32>, tensor<4xi64>) -> tensor<?x8x?x?xf32>
    %396 = shape.shape_of %395 : tensor<?x8x?x?xf32> -> tensor<4xindex>
    %397 = stablehlo.dynamic_broadcast_in_dim %395, %396, dims = [0, 1, 2, 3] : (tensor<?x8x?x?xf32>, tensor<4xindex>) -> tensor<?x8x?x?xf32>
    %398 = stablehlo.dynamic_broadcast_in_dim %82, %396, dims = [] : (tensor<f32>, tensor<4xindex>) -> tensor<?x8x?x?xf32>
